import classNames from 'classnames/bind';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import {
    faClipboardCheck,
    faLocationDot,
    faMobileScreenButton,
    faPhoneVolume,
} from '@fortawesome/free-solid-svg-icons';
import { faEnvelope } from '@fortawesome/free-regular-svg-icons';

import styles from './footer.module.scss';
import img from '~/assets/images/footer/img.svg';
import img1 from '~/assets/images/footer/img1.png';
import img2 from '~/assets/images/footer/img2.png';
import img3 from '~/assets/images/footer/img3.png';

const cx = classNames.bind(styles);

function Footer() {
    return (
        <>
            <div className={cx('wrapper')}>
                <div className={cx('container')}>
                    <div className={cx('content-top')}>
                        <div className={cx('content-top-left')}>
                            <h6 className={cx('header')}>Công ty Cổ phần Công nghệ BookingCare</h6>
                            <div className={cx('child')}>
                                <FontAwesomeIcon className={cx('icon')} icon={faLocationDot} />
                                <span className={cx('child-title')}>
                                    Lô B4/D21, Khu đô thị mới Cầu Giấy, Phường Dịch Vọng Hậu, Quận Cầu Giấy, Thành phố
                                    Hà Nội, Việt Nam
                                </span>
                            </div>

                            <div className={cx('child')}>
                                <FontAwesomeIcon className={cx('icon')} icon={faClipboardCheck} />
                                <span className={cx('child-title')}>
                                    ĐKKD số. 0106790291. Sở KHĐT Hà Nội cấp ngày 16/03/2015
                                </span>
                            </div>

                            <div className={cx('child')}>
                                <FontAwesomeIcon className={cx('icon')} icon={faPhoneVolume} />
                                <span className={cx('child-title')}>024-7301-2468 (7h - 18h)</span>
                            </div>

                            <div className={cx('child')}>
                                <FontAwesomeIcon className={cx('icon')} icon={faEnvelope} />
                                <span className={cx('child-title')}>support@bookingcare.vn (7h - 18h)</span>
                            </div>

                            <h6 className={cx('header')}>Văn phòng tại TP Hồ Chí Minh</h6>
                            <div className={cx('child')}>
                                <FontAwesomeIcon className={cx('icon')} icon={faLocationDot} />
                                <span className={cx('child-title')}>
                                    Tòa nhà H3, 384 Hoàng Diệu, Phường 6, Quận 4, TP.HCM
                                </span>
                            </div>

                            <div className={cx('child')}>
                                <img className={cx('img')} src={img} alt="img" />
                                <img className={cx('img')} src={img} alt="img" />
                            </div>
                        </div>
                        <div className={cx('content-top-middle')}>
                            <div className={cx('son')}>
                                <svg
                                    viewBox="0 0 666.63 146.21"
                                    preserveAspectRatio="none"
                                    width="140"
                                    height="30.799999999999997"
                                >
                                    <path
                                        d="M73.11 41.43a31.68 31.68 0 1 0 31.68 31.68 31.68 31.68 0 0 0-31.68-31.68m19.9 38H79.43v13.65H66.78V79.43H53.21V66.78h13.57V53.13h12.65v13.65H93Z"
                                        className={cx('logo-part1')}
                                    ></path>
                                    <path
                                        d="M73.11 125.24A52.13 52.13 0 0 1 21 74.49V21.88a73.09 73.09 0 1 0 107.67 98.74L112.71 107a52 52 0 0 1-39.6 18.24M73.11 0A72.82 72.82 0 0 0 44.3 5.91l-.3.15a3.76 3.76 0 0 0-2.13 3.37v22A52.14 52.14 0 0 1 113.36 40l16.19-13.33A73 73 0 0 0 73.11 0"
                                        className={cx('logo-part1')}
                                    ></path>
                                    <path
                                        d="M184.43 45.71a16.32 16.32 0 0 1 7.32 5 11.82 11.82 0 0 1 2.59 7.61 12.14 12.14 0 0 1-2.63 7.77 13.19 13.19 0 0 1-7.16 4.53 13.92 13.92 0 0 1 8.54 4.94 14.53 14.53 0 0 1 3.12 9.39 13.67 13.67 0 0 1-2.67 8.38 16.6 16.6 0 0 1-7.61 5.5 32.11 32.11 0 0 1-11.57 1.9h-28V44h26.94a32.23 32.23 0 0 1 11.13 1.71m-7.08 19.34a5.15 5.15 0 0 0 1.78-4.17 4.83 4.83 0 0 0-1.78-4 7.28 7.28 0 0 0-4.86-1.34h-11.33v11h11.33a7.31 7.31 0 0 0 4.86-1.48Zm1.3 22.54a5.25 5.25 0 0 0 2.27-4.53 4.93 4.93 0 0 0-2.27-4.25 10.22 10.22 0 0 0-6.15-1.5h-11.34v11.9h11.33a10.4 10.4 0 0 0 6.15-1.62ZM236.67 59.23a20.42 20.42 0 0 1 8.42 7.85 22.53 22.53 0 0 1 3 11.69 22.68 22.68 0 0 1-3 11.77 20.41 20.41 0 0 1-8.42 7.85 29.58 29.58 0 0 1-25.09 0 20.13 20.13 0 0 1-8.38-7.85 22.91 22.91 0 0 1-3-11.77 22.75 22.75 0 0 1 3-11.69 20.13 20.13 0 0 1 8.38-7.85 29.58 29.58 0 0 1 25.09 0m-19.34 11.85a11.57 11.57 0 0 0-2.59 7.85 11.69 11.69 0 0 0 2.59 7.93 8.55 8.55 0 0 0 6.8 3 8.64 8.64 0 0 0 6.88-3 11.7 11.7 0 0 0 2.59-7.93 11.47 11.47 0 0 0-2.6-7.85 8.68 8.68 0 0 0-6.84-3 8.56 8.56 0 0 0-6.83 3M287.81 59.23a20.42 20.42 0 0 1 8.42 7.85 22.53 22.53 0 0 1 3 11.69 22.68 22.68 0 0 1-3 11.77 20.41 20.41 0 0 1-8.42 7.85 29.58 29.58 0 0 1-25.09 0 20.13 20.13 0 0 1-8.38-7.85 22.91 22.91 0 0 1-3-11.77 22.75 22.75 0 0 1 3-11.69 20.13 20.13 0 0 1 8.38-7.85 29.58 29.58 0 0 1 25.09 0m-19.34 11.85a11.57 11.57 0 0 0-2.59 7.85 11.69 11.69 0 0 0 2.59 7.93 8.55 8.55 0 0 0 6.8 3 8.64 8.64 0 0 0 6.88-3 11.7 11.7 0 0 0 2.59-7.93 11.47 11.47 0 0 0-2.63-7.85 8.68 8.68 0 0 0-6.84-3 8.56 8.56 0 0 0-6.8 3M334.59 100.7l-9.22-16.51-4.45 4.61v11.9H306.5v-60h14.41v31.03l14-14.81h16.35l-16 16.91 16.35 26.87ZM369.34 38.92a7.5 7.5 0 0 1 2.15 5.54 7.53 7.53 0 0 1-2.15 5.5 7.92 7.92 0 0 1-10.92 0 7.53 7.53 0 0 1-2.15-5.5 7.5 7.5 0 0 1 2.15-5.54 8 8 0 0 1 10.92 0m-12.5 18h14.32v43.78h-14.32ZM422.11 60.89q4.33 4.53 4.33 12.22v27.6h-14.33V77.24a8.21 8.21 0 0 0-2-5.87 7.1 7.1 0 0 0-5.42-2.14 8.31 8.31 0 0 0-5.87 2.35 9.54 9.54 0 0 0-2.71 6v23.12h-14.4V56.92h14.4V64a15.56 15.56 0 0 1 6-5.74 17.85 17.85 0 0 1 8.46-1.94q7.21.04 11.54 4.57M477.66 56.92v39.9a19 19 0 0 1-3 10.64 19.42 19.42 0 0 1-8.37 7 29.52 29.52 0 0 1-12.42 2.54 36.57 36.57 0 0 1-10.6-1.54 33.6 33.6 0 0 1-9-4.13l5-10a25.78 25.78 0 0 0 6.47 3.16 22.62 22.62 0 0 0 7 1.13 12 12 0 0 0 7.69-2.27 7.46 7.46 0 0 0 2.83-6.15v-4.67q-4.37 5.75-12.46 5.75a17.56 17.56 0 0 1-16.23-10.08 24.55 24.55 0 0 1-2.39-11 24.29 24.29 0 0 1 2.31-10.84A17.28 17.28 0 0 1 441 59a17.85 17.85 0 0 1 9.55-2.59 17.42 17.42 0 0 1 7.32 1.5 14.29 14.29 0 0 1 5.46 4.33v-5.32Zm-16.75 28a10.92 10.92 0 0 0 2.43-7.36 11.05 11.05 0 0 0-2.43-7.45 8.64 8.64 0 0 0-12.83 0 11 11 0 0 0-2.47 7.4 10.8 10.8 0 0 0 2.47 7.36 8.13 8.13 0 0 0 6.43 2.83 8 8 0 0 0 6.4-2.78M522.17 57.69a15.69 15.69 0 0 0-7.53-2.06 14.72 14.72 0 0 0-7.81 2.15 15.19 15.19 0 0 0-5.54 5.91 18.35 18.35 0 0 0 0 16.75 15.18 15.18 0 0 0 5.54 5.91 14.71 14.71 0 0 0 7.81 2.15 17.18 17.18 0 0 0 7.28-1.78 23.06 23.06 0 0 0 6.8-4.86l8.66 9.31a34.62 34.62 0 0 1-11 7.73 30.45 30.45 0 0 1-27.8-1 28.38 28.38 0 0 1-10.68-10.6 29.51 29.51 0 0 1-3.88-15.05 28.28 28.28 0 0 1 14.85-25.33 32.25 32.25 0 0 1 28-1.17 30.92 30.92 0 0 1 10.44 7.16l-8.58 10.36a21.17 21.17 0 0 0-6.56-5.58M576.56 60.52q5 4.17 5.1 11.69v28.49h-14.17v-4.93q-4.37 5.58-13.19 5.58-7 0-11-3.76a13 13 0 0 1-4-9.91 11.76 11.76 0 0 1 4.36-9.68q4.33-3.48 12.42-3.56h11.41v-.49a5.84 5.84 0 0 0-2.14-4.86 9.79 9.79 0 0 0-6.19-1.7 25 25 0 0 0-6.19.89 36.81 36.81 0 0 0-6.97 2.56l-4-9.71a57 57 0 0 1 10.24-3.6 43.48 43.48 0 0 1 10.16-1.17q9.14 0 14.16 4.16M564.42 90a6.84 6.84 0 0 0 3.08-4.09v-3.8h-8.58q-6.07 0-6.07 4.53a4.47 4.47 0 0 0 1.58 3.6 6.49 6.49 0 0 0 4.33 1.34 10.16 10.16 0 0 0 5.66-1.58M611.15 58.38a16.49 16.49 0 0 1 8.21-2v13.17a21.73 21.73 0 0 0-2.18-.08 13.32 13.32 0 0 0-8.25 2.39 9.15 9.15 0 0 0-3.64 6.51v22.33h-14.4V56.92h14.4v7.28a15.77 15.77 0 0 1 5.86-5.82M660.88 62.75q5.74 6.31 5.75 17.32 0 1.7-.08 2.59h-30.43a10.51 10.51 0 0 0 3.64 5.71 10.07 10.07 0 0 0 6.31 2 13.66 13.66 0 0 0 5.46-1.13 15.43 15.43 0 0 0 4.82-3.32l7.53 7.53a22.19 22.19 0 0 1-8.21 5.79 28.33 28.33 0 0 1-10.88 2 26.18 26.18 0 0 1-12.3-2.75 19.12 19.12 0 0 1-8.05-7.77A23.57 23.57 0 0 1 621.63 79a24.16 24.16 0 0 1 2.83-11.86 19.56 19.56 0 0 1 8-7.93 24.85 24.85 0 0 1 12-2.79q10.67.02 16.42 6.33M652.63 75a8.43 8.43 0 0 0-2.23-6.11 8.46 8.46 0 0 0-11.57 0 11.27 11.27 0 0 0-3 6.15Z"
                                        className={cx('logo-part2')}
                                    ></path>
                                </svg>
                            </div>

                            <a href="/" className={cx('son')}>
                                Tuyển dụng
                            </a>
                            <a href="/" className={cx('son')}>
                                Chính sách bảo mật
                            </a>
                            <a href="/" className={cx('son')}>
                                Quy chế hoạt động
                            </a>
                            <a href="/" className={cx('son')}>
                                Liên hệ hợp tác
                            </a>

                            <a href="/" className={cx('son')}>
                                Điều khoản sử dụng
                            </a>

                            <a href="/" className={cx('son')}>
                                Câu hỏi thường gặp
                            </a>
                        </div>
                        <div className={cx('content-top-right')}>
                            <h6 className={cx('header')}>Đối tác bảo trợ nội dung</h6>
                            <div className={cx('child-right')}>
                                <div>
                                    <img src={img1} alt="img" />
                                </div>
                                <div className={cx('child-title')}>
                                    <h6 className={cx('title-header')}>Hello Doctor</h6>
                                    <span className={cx('title')}>
                                        Bảo trợ chuyên mục nội dung "sức khỏe tinh thần"
                                    </span>
                                </div>
                            </div>

                            <div className={cx('child-right')}>
                                <div>
                                    <img src={img2} alt="img" />
                                </div>
                                <div className={cx('child-title')}>
                                    <h6 className={cx('title-header')}>Hệ thống y khoa chuyên sâu quốc tế Bernard</h6>
                                    <span className={cx('title')}>Bảo trợ chuyên mục nội dung "y khoa chuyên sâu"</span>
                                </div>
                            </div>

                            <div className={cx('child-right')}>
                                <div>
                                    <img src={img3} alt="img" />
                                </div>
                                <div className={cx('child-title')}>
                                    <h6 className={cx('title-header')}>Doctor Check - Tầm Soát Bệnh Để Sống Thọ Hơn</h6>
                                    <span className={cx('title')}>
                                        Bảo trợ chuyên mục nội dung "sức khỏe tổng quát"
                                    </span>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className={cx('content-bottom')}>
                        <div className={cx('dowload')}>
                            <FontAwesomeIcon className={cx('dowload-icon')} icon={faMobileScreenButton} />
                            <span className={cx('dowload-title')}>
                                Tải ứng dụng BookingCare cho điện thoại hoặc máy tính bảng:{' '}
                                <a href="/" className={cx('title-link')}>
                                    Android - iPhone/iPad - Khác
                                </a>
                            </span>
                        </div>
                    </div>
                </div>
            </div>

            <div className={cx('copyright')}>
                <div className="container">
                    <div className={cx('copyright-content')}>
                        <div className={cx('copyright-title')}>© 2024 BookingCare.</div>
                        <div className={cx('copyright-logo')}>
                            <a href="/" className={cx('copyright-logo')}>
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    width="32"
                                    height="32"
                                    viewBox="0 0 250 250"
                                    preserveAspectRatio="none"
                                >
                                    <g fill-rule="evenodd" clip-rule="evenodd">
                                        <path
                                            fill="#010101"
                                            d="M25 0h200c13.808 0 25 11.192 25 25v200c0 13.808-11.192 25-25 25H25c-13.808 0-25-11.192-25-25V25C0 11.192 11.192 0 25 0"
                                        ></path>
                                        <path
                                            fill="#ee1d51"
                                            d="M156.98 230c7.607 0 13.774-6.117 13.774-13.662s-6.167-13.663-13.774-13.663h-2.075c7.607 0 13.774 6.118 13.774 13.663S162.512 230 154.905 230z"
                                        ></path>
                                        <path
                                            fill="#66c8cf"
                                            d="M154.717 202.675h-2.075c-7.607 0-13.775 6.118-13.775 13.663S145.035 230 152.642 230h2.075c-7.608 0-13.775-6.117-13.775-13.662s6.167-13.663 13.775-13.663"
                                        ></path>
                                        <ellipse
                                            cx="154.811"
                                            cy="216.338"
                                            fill="#010101"
                                            rx="6.699"
                                            ry="6.643"
                                        ></ellipse>
                                        <path
                                            fill="#fff"
                                            d="M50 196.5v6.925h8.112v26.388h8.115v-26.201h6.603l2.264-7.112zm66.415 0v6.925h8.112v26.388h8.115v-26.201h6.603l2.264-7.112zm-39.81 3.93c0-2.17 1.771-3.93 3.959-3.93 2.19 0 3.963 1.76 3.963 3.93s-1.772 3.93-3.963 3.93c-2.188-.001-3.959-1.76-3.959-3.93m0 6.738h7.922v22.645h-7.922zM87.924 196.5v33.313h7.925v-8.608l2.453-2.248L106.037 230h8.49l-11.133-16.095 10-9.733h-9.622l-7.923 7.86V196.5zm85.47 0v33.313h7.926v-8.608l2.452-2.248L191.509 230H200l-11.133-16.095 10-9.733h-9.622l-7.925 7.86V196.5z"
                                        ></path>
                                        <path
                                            fill="#ee1d52"
                                            d="M161.167 81.186c10.944 7.819 24.352 12.42 38.832 12.42V65.755a39.26 39.26 0 0 1-8.155-.853v21.923c-14.479 0-27.885-4.601-38.832-12.42v56.835c0 28.432-23.06 51.479-51.505 51.479-10.613 0-20.478-3.207-28.673-8.707C82.187 183.57 95.23 189.5 109.66 189.5c28.447 0 51.508-23.047 51.508-51.48V81.186zm10.06-28.098c-5.593-6.107-9.265-14-10.06-22.726V26.78h-7.728c1.945 11.09 8.58 20.565 17.788 26.308m-80.402 99.107a23.445 23.445 0 0 1-4.806-14.256c0-13.004 10.548-23.547 23.561-23.547a23.6 23.6 0 0 1 7.147 1.103V87.022a51.97 51.97 0 0 0-8.152-.469v22.162a23.619 23.619 0 0 0-7.15-1.103c-13.013 0-23.56 10.543-23.56 23.548 0 9.195 5.272 17.157 12.96 21.035"
                                        ></path>
                                        <path
                                            fill="#fff"
                                            d="M153.012 74.405c10.947 7.819 24.353 12.42 38.832 12.42V64.902c-8.082-1.72-15.237-5.942-20.617-11.814-9.208-5.743-15.843-15.218-17.788-26.308H133.14v111.239c-.046 12.968-10.576 23.468-23.561 23.468-7.652 0-14.45-3.645-18.755-9.292-7.688-3.878-12.96-11.84-12.96-21.035 0-13.005 10.547-23.548 23.56-23.548 2.493 0 4.896.388 7.15 1.103V86.553c-27.945.577-50.42 23.399-50.42 51.467 0 14.011 5.597 26.713 14.68 35.993 8.195 5.5 18.06 8.707 28.673 8.707 28.445 0 51.505-23.048 51.505-51.479z"
                                        ></path>
                                        <path
                                            fill="#69c9d0"
                                            d="M191.844 64.902v-5.928a38.84 38.84 0 0 1-20.617-5.887 38.948 38.948 0 0 0 20.617 11.815M153.439 26.78a39.524 39.524 0 0 1-.427-3.198V20h-28.028v111.24c-.045 12.967-10.574 23.467-23.56 23.467-3.813 0-7.412-.904-10.6-2.512 4.305 5.647 11.103 9.292 18.755 9.292 12.984 0 23.515-10.5 23.561-23.468V26.78zm-44.864 59.773v-6.311a51.97 51.97 0 0 0-7.067-.479C73.06 79.763 50 102.811 50 131.24c0 17.824 9.063 33.532 22.835 42.772-9.083-9.28-14.68-21.982-14.68-35.993 0-28.067 22.474-50.889 50.42-51.466"
                                        ></path>
                                        <path
                                            fill="#fff"
                                            d="M154.904 230c7.607 0 13.775-6.117 13.775-13.662s-6.168-13.663-13.775-13.663h-.188c-7.607 0-13.774 6.118-13.774 13.663S147.109 230 154.716 230zm-6.792-13.662c0-3.67 3-6.643 6.7-6.643 3.697 0 6.697 2.973 6.697 6.643s-3 6.645-6.697 6.645c-3.7-.001-6.7-2.975-6.7-6.645"
                                        ></path>
                                    </g>
                                </svg>
                            </a>
                            <a href="/" className={cx('copyright-logo')}>
                                <svg width="32" height="32" preserveAspectRatio="none" viewBox="0 0 128 128">
                                    <path
                                        fill="#3C579E"
                                        d="M128 112c0 8.8-7.2 16-16 16H16c-8.8 0-16-7.2-16-16V16C0 7.2 7.2 0 16 0h96c8.8 0 16 7.2 16 16z"
                                    ></path>
                                    <path
                                        fill="#FFF"
                                        d="M68.877 128V78.188h-17.78V60.425h17.784V44.029c0-16.537 9.764-26.279 24.514-26.279 7.068 0 12.834.756 14.605.991v18.573l-11.874-.005c-8.022 0-9.523 3.979-9.523 9.572v13.544h20.556l-2.904 17.763H86.603V128z"
                                    ></path>
                                </svg>
                            </a>
                            <a href="/" className={cx('copyright-logo')}>
                                <svg width="32" height="32" preserveAspectRatio="none" viewBox="0 0 128 128">
                                    <path
                                        fill="#CC191E"
                                        d="M128 112c0 8.8-7.2 16-16 16H16c-8.8 0-16-7.2-16-16V16C0 7.2 7.2 0 16 0h96c8.8 0 16 7.2 16 16z"
                                    ></path>
                                    <path
                                        fill="#FFF"
                                        d="M107.122 46.404s-.86-6.064-3.499-8.733c-3.348-3.506-7.098-3.523-8.816-3.728-12.312-.891-30.787-.891-30.787-.891h-.04s-18.474 0-30.787.891c-1.721.204-5.469.221-8.816 3.728-2.639 2.669-3.498 8.733-3.498 8.733S20 53.525 20 60.647v6.677c0 7.119.879 14.242.879 14.242s.859 6.062 3.498 8.732c3.348 3.508 7.745 3.396 9.702 3.764 7.041.676 29.922.885 29.922.885s18.49-.028 30.806-.918c1.721-.206 5.471-.223 8.817-3.729 2.64-2.672 3.499-8.733 3.499-8.733s.877-7.122.877-14.243v-6.677c0-7.122-.878-14.243-.878-14.243m-53.32 30.165-.003-27.038 26 13.565z"
                                    ></path>
                                </svg>
                            </a>
                        </div>
                    </div>
                </div>
            </div>
        </>
    );
}

export default Footer;
